src/Reports/ОтчетПоНормированиюУЛИШИ/ОтчетПоНормированиюУЛИШИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоНормированиюУЛИШИ</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/Оборудование/Оборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Оборудование</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>СтоимостьМЧПлановая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьМЧРасчётная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.ТехОснастка</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НормыВремени/НормыВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыВремени</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаПартию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТехОперация</name>
    <type>
      <types>CatalogRef.ТехОперации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НормыТО/НормыТО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыТО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МашинноеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаНастройку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаОбдув</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТехОперация</name>
    <type>
      <types>CatalogRef.ТехОперации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ИндивидуальнаяСделка/ИндивидуальнаяСделка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИндивидуальнаяСделка</name>
  <posting>Deny</posting>
  <attributes>
    <name>БезУчётаВыходныхДней</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проектные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВедомостьВыходногоДня</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочихЧасовВМесяце</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочихЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПоНаряду</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОплатаВВыходной</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Премия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДП</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>П1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>П2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>П3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехОперации</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ТехОперация</name>
      <type>
        <types>CatalogRef.ТехОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочихЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазрядоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ВыпускПродукцииКанбан/ВыпускПродукцииКанбан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукцииКанбан</name>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ПланыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.БракПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.КомментарииНеисправностей</types>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Списание</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Линейки/Линейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Линейки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидЛинейки</name>
    <type>
      <types>EnumRef.ВидыЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>Проектная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НумераторОчереди</name>
    <type>
      <types>CatalogRef.НумераторОчереди</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСтарое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияБрака</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияГП</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияКанбанов</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НумераторГрупповойУпаковки</name>
    <type>
      <types>CatalogRef.НумераторГрупповыхУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьБарКоды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеВБракВыпуском</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаAccess</name>
    <type>
      <types>CatalogRef.ОбменДанными</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьОдноПЗПоМТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодкаталогФотографий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаЛинеек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаКомплектации</name>
    <type>
      <types>EnumRef.ЗоныКомплектации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Принтеры</name>
    <attributes>
      <name>ШаблонДокумента</name>
      <type>
        <types>CatalogRef.ШаблоныПечатныхДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Принтер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаЛинеек</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛинейкиПотребители</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыКанбанов</name>
    <attributes>
      <name>ВидКанбана</name>
      <type>
        <types>CatalogRef.ВидыКанбанов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Reports/ОтчетПоНормированиюУЛИШИ/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Документ) Тогда
	ПараметрыДокумента = ПолучитьПараметрыДокумента(ЭтаФорма.Параметры.Документ);	
	СписокЛинеек.Очистить();
    ПолучитьСписокЛинеек(ПараметрыДокумента.Линейка,ПараметрыДокумента.Проектные);	
		Если ПараметрыДокумента.ВедомостьВыходногоДня Тогда        
		Отчет.Период.ДатаНачала = ПараметрыДокумента.Дата;			
		Отчет.Период.ДатаОкончания = ПараметрыДокумента.Дата;
		Иначе
		Отчет.Период.ДатаНачала = НачалоМесяца(ПараметрыДокумента.Дата);			
		Отчет.Период.ДатаОкончания = КонецМесяца(ПараметрыДокумента.Дата);		
		КонецЕсли;
	БезУчётаВыходныхДней = ПараметрыДокумента.БезУчётаВыходныхДней;
		Если БезУчётаВыходныхДней Тогда
		СписокВыходныхДней.Очистить();
		ПолучитьСписокВыходныхДней(ЭтаФорма.Параметры.Документ);		
		КонецЕсли;
	Сформировать(Неопределено);   	
	КонецЕсли; 
КонецПроцедуры 

&НаСервере
Функция ПолучитьПараметрыДокумента(Документ)
Парам = Новый Структура("Линейка,ЭтоГруппа,Дата,ВедомостьВыходногоДня,БезУчётаВыходныхДней,Проектные",Документ.Линейка,Документ.Линейка.ЭтоГруппа,Документ.Дата,Документ.ВедомостьВыходногоДня,Документ.БезУчётаВыходныхДней,Документ.Проектные);
Возврат(Парам);
КонецФункции

&НаСервере
Функция ПолучитьСписокВыходныхДней(Документ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИндивидуальнаяСделка.Дата
	|ИЗ
	|	Документ.ИндивидуальнаяСделка КАК ИндивидуальнаяСделка
	|ГДЕ
	|	ИндивидуальнаяСделка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ИндивидуальнаяСделка.Подразделение = &Подразделение
	|	И ИндивидуальнаяСделка.ВедомостьВыходногоДня = ИСТИНА
	|	И ИндивидуальнаяСделка.ПометкаУдаления = ЛОЖЬ
	|	И ИндивидуальнаяСделка.Комментарий ПОДОБНО &Комментарий";
Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Документ.Дата));
Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Документ.Дата));
Запрос.УстановитьПараметр("Подразделение", Документ.Подразделение);
Запрос.УстановитьПараметр("Комментарий", Документ.Комментарий);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокВыходныхДней.Добавить(ВыборкаДетальныеЗаписи.Дата);
	КонецЦикла;
КонецФункции

&НаСервере
Функция ПолучитьСписокЛинеек(ГруппаЛинеек,Проектные)
Линейки = Справочники.Линейки.Выбрать(ГруппаЛинеек);
	Пока Линейки.Следующий() Цикл
		Если Линейки.Проектная = Проектные Тогда
		СписокЛинеек.Добавить(Линейки.Ссылка);
		КонецЕсли;			
	КонецЦикла;
КонецФункции
      
&НаСервере
Процедура ПолучитьТекстЗапроса(Запрос)
	Если Не Станок.Пустая() или Не Прессформа.Пустая() Тогда
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыпускПродукцииКанбан.Дата КАК ДатаВыпуска,
		|	ВыпускПродукцииКанбан.ДокументОснование КАК ПЗ,
		|	ВыпускПродукцииКанбан.Изделие КАК Изделие,
		|	ЭтапыПроизводственныхЗаданийСрезПоследних.Исполнитель КАК Исполнитель,
		|	ПроизводственноеЗаданиеПрессформы.Станок КАК Станок,
		|	ПроизводственноеЗаданиеПрессформы.Прессформа КАК Прессформа
		|ИЗ
		|	РегистрСведений.ЭтапыПроизводственныхЗаданий.СрезПоследних КАК ЭтапыПроизводственныхЗаданийСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыпускПродукцииКанбан КАК ВыпускПродукцииКанбан
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводственноеЗадание.Прессформы КАК ПроизводственноеЗаданиеПрессформы
		|			ПО (ПроизводственноеЗаданиеПрессформы.Ссылка = ВыпускПродукцииКанбан.ДокументОснование)
		|		ПО ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ = ВыпускПродукцииКанбан.ДокументОснование
		|ГДЕ
		|	ВыпускПродукцииКанбан.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И ВыпускПродукцииКанбан.ДокументОснование.Линейка В ИЕРАРХИИ(&СписокЛинеек)"; 
	Иначе
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыпускПродукцииКанбан.Дата КАК ДатаВыпуска,
		|	ВыпускПродукцииКанбан.ДокументОснование КАК ПЗ,
		|	ВыпускПродукцииКанбан.Изделие КАК Изделие,
		|	ЭтапыПроизводственныхЗаданийСрезПоследних.Исполнитель КАК Исполнитель,
		|	ПроизводственноеЗаданиеПрессформы.Станок КАК Станок,
		|	ПроизводственноеЗаданиеПрессформы.Прессформа КАК Прессформа
		|ИЗ
		|	РегистрСведений.ЭтапыПроизводственныхЗаданий.СрезПоследних КАК ЭтапыПроизводственныхЗаданийСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыпускПродукцииКанбан КАК ВыпускПродукцииКанбан
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводственноеЗадание.Прессформы КАК ПроизводственноеЗаданиеПрессформы
		|			ПО (ПроизводственноеЗаданиеПрессформы.Ссылка = ВыпускПродукцииКанбан.ДокументОснование)
		|		ПО ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ = ВыпускПродукцииКанбан.ДокументОснование
		|ГДЕ
		|	ВыпускПродукцииКанбан.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И ВыпускПродукцииКанбан.ДокументОснование.Линейка В ИЕРАРХИИ(&СписокЛинеек)"; 	
	КонецЕсли;

	Если БезУчётаВыходныхДней Тогда	
	Запрос.Текст = Запрос.Текст + " И НЕ НАЧАЛОПЕРИОДА(ВыпускПродукцииКанбан.Дата, ДЕНЬ) В (&СписокВыходныхДней)";
    Запрос.УстановитьПараметр("СписокВыходныхДней", СписокВыходныхДней);
	КонецЕсли;
		Если СписокНоменклатуры.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И ВыпускПродукцииКанбан.Изделие В ИЕРАРХИИ(&СписокНоменклатуры)";
	    Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
		КонецЕсли;
			Если Не Исполнитель.Пустая() Тогда
			Запрос.Текст = Запрос.Текст + " И ЭтапыПроизводственныхЗаданийСрезПоследних.Исполнитель = &Исполнитель";
		    Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
			КонецЕсли;
				Если Не Станок.Пустая() Тогда
				Запрос.Текст = Запрос.Текст + " И ПроизводственноеЗаданиеПрессформы.Станок = &Станок";
			    Запрос.УстановитьПараметр("Станок", Станок);
				КонецЕсли;
					Если Не Прессформа.Пустая() Тогда
					Запрос.Текст = Запрос.Текст + " И ПроизводственноеЗаданиеПрессформы.Прессформа = &Прессформа";
				    Запрос.УстановитьПараметр("Прессформа", Прессформа);
					КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьПоПЗНаСервере()
ТабДок.Очистить();
Запрос = Новый Запрос;

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблПЗ = Макет.ПолучитьОбласть("ПЗ");
ОблТО = Макет.ПолучитьОбласть("ТО");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ВидОтчёта = ?(БезУчётаВыходныхДней,"Без учёта выходных дней: "+СписокВыходныхДней,"");
ТабДок.Вывести(ОблШапка); 

ПолучитьТекстЗапроса(Запрос);
Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО
								|	ВыпускПродукцииКанбан.ДокументОснование.Номер"; 
Запрос.УстановитьПараметр("ДатаНач", Отчет.Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Отчет.Период.ДатаОкончания);
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаПЗ = РезультатЗапроса.Выбрать();
НВИтого = 0;
СтоимостьМЧИтого = 0;
Наряд = 0;
	Пока ВыборкаПЗ.Следующий() Цикл 
	ПЗ = ВыборкаПЗ.ПЗ;
		Если ПЗ.Прессформы.Количество() > 0 Тогда
		РО = РегистрыСведений.Оборудование.ПолучитьПоследнее(ВыборкаПЗ.ДатаВыпуска,Новый Структура("Оборудование",ПЗ.Прессформы[0].Станок));			
		СтоимостьМЧ = РО.СтоимостьМЧРасчётная;		
		Иначе	
		СтоимостьМЧ = 0;
		КонецЕсли;
	НВИтого = 0;
	СтоимостьМЧИтого = 0;
	Наряд = 0;
	ОблПЗ.Параметры.НомерПЗ = ПЗ.Номер;
	ОблПЗ.Параметры.ПЗ = ПЗ;
	ТаблицаНВ = РегистрыСведений.НормыВремени.СрезПоследних(ВыборкаПЗ.ДатаВыпуска,Новый Структура("МПЗ",ВыборкаПЗ.Изделие));
	ТаблицаНВ.Сортировать("ТехОперация");
		Для каждого ТЧ Из ТаблицаНВ Цикл
			Если ТЧ.НормаВремени > 0 Тогда
			НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(ВыборкаПЗ.ДатаВыпуска,Новый Структура("ТехОперация",ТЧ.ТехОперация));
			НВИтого = НВИтого + ТЧ.НормаВремени*ПЗ.Количество;
			СтоимостьМЧИтого = СтоимостьМЧИтого + ТЧ.НормаВремени/60*СтоимостьМЧ*ПЗ.Количество;
			Наряд = Наряд + Окр(ТЧ.НормаВремени/60*НормыТО.Стоимость,2,РежимОкругления.Окр15как20)*ПЗ.Количество;
			КонецЕсли;
		КонецЦикла;
	ОблПЗ.Параметры.НВИтого = НВИтого;
	ОблПЗ.Параметры.СтоимостьМЧИтого = СтоимостьМЧИтого;
	ОблПЗ.Параметры.Наряд = Наряд;
	ТабДок.Вывести(ОблПЗ);
	ТабДок.НачатьГруппуСтрок("ТО",Истина);
	флПЗ = Ложь;
		Для каждого ТЧ Из ТаблицаНВ Цикл
			Если ТЧ.НормаВремени > 0 Тогда
			флПЗ = Истина;
			ОблТО.Параметры.НомерПЗ = ПЗ.Номер;
			ОблТО.Параметры.ПЗ = ПЗ;                    
			ОблТО.Параметры.ДатаОкончания = ВыборкаПЗ.ДатаВыпуска;
			ОблТО.Параметры.Наименование = СокрЛП(ВыборкаПЗ.Изделие.Наименование);
			ОблТО.Параметры.Номенклатура = ВыборкаПЗ.Изделие;
			ОблТО.Параметры.Количество = ПЗ.Количество;
			ОблТО.Параметры.Исполнитель = ВыборкаПЗ.Исполнитель;
			ОблТО.Параметры.НаименованиеТО = СокрЛП(ТЧ.ТехОперация.Наименование);
			ОблТО.Параметры.ТО = ТЧ.ТехОперация;
			ОблТО.Параметры.ВидРабот = ТЧ.ТехОперация.ВидРабот;
				Если Найти(ТЧ.ТехОперация.ВидРабот.Наименование,"Литьё") > 0 Тогда
					Если ПЗ.Прессформы.Количество() > 0 Тогда
					ОблТО.Параметры.Станок = ПЗ.Прессформы[0].Станок;
					ОблТО.Параметры.Прессформа = ПЗ.Прессформы[0].Прессформа;
					Иначе	
					ОблТО.Параметры.Станок = "";
					ОблТО.Параметры.Прессформа = "";			
					КонецЕсли;				
				Иначе
	 			ОблТО.Параметры.Станок = "";
				ОблТО.Параметры.Прессформа = "";
				КонецЕсли;
			ОблТО.Параметры.КоличествоТО = ПЗ.Количество;          
			ОблТО.Параметры.НВ = ТЧ.НормаВремени;
			НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(ВыборкаПЗ.ДатаВыпуска,Новый Структура("ТехОперация",ТЧ.ТехОперация));
			ОблТО.Параметры.ТС = НормыТО.Стоимость;
			ОблТО.Параметры.СтоимостьМЧ = СтоимостьМЧ;
			ОблТО.Параметры.СтоимостьМЧНаИзд = ОблТО.Параметры.НВ/60*СтоимостьМЧ;
			ОблТО.Параметры.Расценка = Окр(ОблТО.Параметры.НВ/60*ОблТО.Параметры.ТС,2,РежимОкругления.Окр15как20);
			ОблТО.Параметры.НВИтого = ОблТО.Параметры.НВ*ПЗ.Количество;
			ОблТО.Параметры.СтоимостьМЧИтого = ОблТО.Параметры.СтоимостьМЧНаИзд*ПЗ.Количество;
			ОблТО.Параметры.Наряд = ОблТО.Параметры.Расценка*ПЗ.Количество;
			ТабДок.Вывести(ОблТО);
			КонецЕсли;
		КонецЦикла;
			Если Не флПЗ Тогда
			ОблТО.Параметры.НомерПЗ = ПЗ.Номер;
			ОблТО.Параметры.ПЗ = ПЗ;                    
			ОблТО.Параметры.ДатаОкончания = ВыборкаПЗ.ДатаВыпуска;
			ОблТО.Параметры.Наименование = СокрЛП(ВыборкаПЗ.Изделие.Наименование);
			ОблТО.Параметры.Номенклатура = ВыборкаПЗ.Изделие;
			ОблТО.Параметры.Количество = ПЗ.Количество;
			ОблТО.Параметры.Исполнитель = ВыборкаПЗ.Исполнитель;
			ОблТО.Параметры.НаименованиеТО = "";
			ОблТО.Параметры.ТО = "";
			ОблТО.Параметры.ВидРабот = "";
				Если ПЗ.Прессформы.Количество() > 0 Тогда
				ОблТО.Параметры.Станок = ПЗ.Прессформы[0].Станок;
				ОблТО.Параметры.Прессформа = ПЗ.Прессформы[0].Прессформа;
				Иначе	
				ОблТО.Параметры.Станок = "";
				ОблТО.Параметры.Прессформа = "";			
				КонецЕсли;				
			ОблТО.Параметры.КоличествоТО = 0;          
			ОблТО.Параметры.НВ = 0;
			ОблТО.Параметры.ТС = 0;
			ОблТО.Параметры.СтоимостьМЧ = 0;
			ОблТО.Параметры.СтоимостьМЧНаИзд = 0;
			ОблТО.Параметры.Расценка = 0;
			ОблТО.Параметры.НВИтого = 0;
			ОблТО.Параметры.СтоимостьМЧИтого = 0;
			ОблТО.Параметры.Наряд = 0;
			ТабДок.Вывести(ОблТО); 
			КонецЕсли;
	ТабДок.ЗакончитьГруппуСтрок();	
	КонецЦикла;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 3;
ТабДок.ФиксацияСлева = 5;
КонецПроцедуры

&НаСервере
Процедура СформироватьПоСтанкамНаСервере()
ТабДок.Очистить();
Запрос = Новый Запрос;

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблСтанок = Макет.ПолучитьОбласть("Станок");
ОблТО = Макет.ПолучитьОбласть("ТО");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ВидОтчёта = ?(БезУчётаВыходныхДней,"Без учёта выходных дней: "+СписокВыходныхДней,"");
ТабДок.Вывести(ОблШапка);

ПолучитьТекстЗапроса(Запрос);
Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО
								|	ПроизводственноеЗаданиеПрессформы.Станок.Наименование
								|ИТОГИ ПО
								|	Станок"; 
Запрос.УстановитьПараметр("ДатаНач", Отчет.Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Отчет.Период.ДатаОкончания);
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаСтанок = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
НВИтого = 0;
СтоимостьМЧИтого = 0;
Наряд = 0;
	Пока ВыборкаСтанок.Следующий() Цикл
	НВИтого = 0;
	СтоимостьМЧИтого = 0;
	Наряд = 0;
	ОблСтанок.Параметры.Станок = ВыборкаСтанок.Станок;	
	ВыборкаПЗ = ВыборкаСтанок.Выбрать();
		Пока ВыборкаПЗ.Следующий() Цикл
		ПЗ = ВыборкаПЗ.ПЗ;
			Если ПЗ.Прессформы.Количество() > 0 Тогда
			РО = РегистрыСведений.Оборудование.ПолучитьПоследнее(ВыборкаПЗ.ДатаВыпуска,Новый Структура("Оборудование",ПЗ.Прессформы[0].Станок));			
			СтоимостьМЧ = РО.СтоимостьМЧРасчётная;		
			Иначе	
			СтоимостьМЧ = 0;
			КонецЕсли;
		ТаблицаНВ = РегистрыСведений.НормыВремени.СрезПоследних(ВыборкаПЗ.ДатаВыпуска,Новый Структура("МПЗ",ВыборкаПЗ.Изделие));
		ТаблицаНВ.Сортировать("ТехОперация");
			Для каждого ТЧ Из ТаблицаНВ Цикл
				Если ТЧ.НормаВремени > 0 Тогда
				НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(ВыборкаПЗ.ДатаВыпуска,Новый Структура("ТехОперация",ТЧ.ТехОперация));
				НВИтого = НВИтого + ТЧ.НормаВремени*ПЗ.Количество;
				СтоимостьМЧИтого = СтоимостьМЧИтого + ТЧ.НормаВремени/60*СтоимостьМЧ*ПЗ.Количество;
				Наряд = Наряд + Окр(ТЧ.НормаВремени/60*НормыТО.Стоимость,2,РежимОкругления.Окр15как20)*ПЗ.Количество; 
				КонецЕсли;
			КонецЦикла;              
		КонецЦикла;    
	ОблСтанок.Параметры.НВИтого = НВИтого;
	ОблСтанок.Параметры.СтоимостьМЧИтого = СтоимостьМЧИтого;
	ОблСтанок.Параметры.Наряд = Наряд;
	ТабДок.Вывести(ОблСтанок);
	ТабДок.НачатьГруппуСтрок("ТО",Истина); 
	ВыборкаПЗ.Сбросить();
		Пока ВыборкаПЗ.Следующий() Цикл 
		ПЗ = ВыборкаПЗ.ПЗ;
			Если ПЗ.Прессформы.Количество() > 0 Тогда
			РО = РегистрыСведений.Оборудование.ПолучитьПоследнее(ВыборкаПЗ.ДатаВыпуска,Новый Структура("Оборудование",ПЗ.Прессформы[0].Станок));			
			СтоимостьМЧ = РО.СтоимостьМЧРасчётная;		
			Иначе	
			СтоимостьМЧ = 0;
			КонецЕсли;
		ТаблицаНВ = РегистрыСведений.НормыВремени.СрезПоследних(ВыборкаПЗ.ДатаВыпуска,Новый Структура("МПЗ",ВыборкаПЗ.Изделие));
		ТаблицаНВ.Сортировать("ТехОперация"); 
		флПЗ = Ложь;
			Для каждого ТЧ Из ТаблицаНВ Цикл 
				Если ТЧ.НормаВремени > 0 Тогда
				флПЗ = Истина;
				ОблТО.Параметры.НомерПЗ = ПЗ.Номер;
				ОблТО.Параметры.ПЗ = ПЗ;                    
				ОблТО.Параметры.ДатаОкончания = ВыборкаПЗ.ДатаВыпуска;
				ОблТО.Параметры.Наименование = СокрЛП(ВыборкаПЗ.Изделие.Наименование);
				ОблТО.Параметры.Номенклатура = ВыборкаПЗ.Изделие;
				ОблТО.Параметры.Количество = ПЗ.Количество;
				ОблТО.Параметры.Исполнитель = ВыборкаПЗ.Исполнитель;
				ОблТО.Параметры.НаименованиеТО = СокрЛП(ТЧ.ТехОперация.Наименование);
				ОблТО.Параметры.ТО = ТЧ.ТехОперация;
				ОблТО.Параметры.ВидРабот = ТЧ.ТехОперация.ВидРабот;
					Если Найти(ТЧ.ТехОперация.ВидРабот.Наименование,"Литьё") > 0 Тогда
						Если ПЗ.Прессформы.Количество() > 0 Тогда
						ОблТО.Параметры.Станок = ПЗ.Прессформы[0].Станок;
						ОблТО.Параметры.Прессформа = ПЗ.Прессформы[0].Прессформа;
						Иначе	
						ОблТО.Параметры.Станок = "";
						ОблТО.Параметры.Прессформа = "";			
						КонецЕсли;				
					Иначе
		 			ОблТО.Параметры.Станок = "";
					ОблТО.Параметры.Прессформа = "";
					КонецЕсли;
				ОблТО.Параметры.КоличествоТО = ПЗ.Количество;          
				ОблТО.Параметры.НВ = ТЧ.НормаВремени;
				НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(ВыборкаПЗ.ДатаВыпуска,Новый Структура("ТехОперация",ТЧ.ТехОперация));
				ОблТО.Параметры.ТС = НормыТО.Стоимость;
				ОблТО.Параметры.СтоимостьМЧ = СтоимостьМЧ;
				ОблТО.Параметры.СтоимостьМЧНаИзд = ОблТО.Параметры.НВ/60*СтоимостьМЧ;
				ОблТО.Параметры.Расценка = Окр(ОблТО.Параметры.НВ/60*ОблТО.Параметры.ТС,2,РежимОкругления.Окр15как20);
				ОблТО.Параметры.НВИтого = ОблТО.Параметры.НВ*ПЗ.Количество;
				ОблТО.Параметры.СтоимостьМЧИтого = ОблТО.Параметры.СтоимостьМЧНаИзд*ПЗ.Количество;
				ОблТО.Параметры.Наряд = ОблТО.Параметры.Расценка*ПЗ.Количество;
				ТабДок.Вывести(ОблТО); 
				КонецЕсли;
			КонецЦикла; 
				Если Не флПЗ Тогда
				ОблТО.Параметры.НомерПЗ = ПЗ.Номер;
				ОблТО.Параметры.ПЗ = ПЗ;                    
				ОблТО.Параметры.ДатаОкончания = ВыборкаПЗ.ДатаВыпуска;
				ОблТО.Параметры.Наименование = СокрЛП(ВыборкаПЗ.Изделие.Наименование);
				ОблТО.Параметры.Номенклатура = ВыборкаПЗ.Изделие;
				ОблТО.Параметры.Количество = ПЗ.Количество;
				ОблТО.Параметры.Исполнитель = ВыборкаПЗ.Исполнитель;
				ОблТО.Параметры.НаименованиеТО = "";
				ОблТО.Параметры.ТО = "";
				ОблТО.Параметры.ВидРабот = "";
					Если ПЗ.Прессформы.Количество() > 0 Тогда
					ОблТО.Параметры.Станок = ПЗ.Прессформы[0].Станок;
					ОблТО.Параметры.Прессформа = ПЗ.Прессформы[0].Прессформа;
					Иначе	
					ОблТО.Параметры.Станок = "";
					ОблТО.Параметры.Прессформа = "";			
					КонецЕсли;				
				ОблТО.Параметры.КоличествоТО = 0;          
				ОблТО.Параметры.НВ = 0;
				ОблТО.Параметры.ТС = 0;
				ОблТО.Параметры.СтоимостьМЧ = 0;
				ОблТО.Параметры.СтоимостьМЧНаИзд = 0;
				ОблТО.Параметры.Расценка = 0;
				ОблТО.Параметры.НВИтого = 0;
				ОблТО.Параметры.СтоимостьМЧИтого = 0;
				ОблТО.Параметры.Наряд = 0;
				ТабДок.Вывести(ОблТО); 
				КонецЕсли;              
		КонецЦикла;
	ТабДок.ЗакончитьГруппуСтрок();	
	КонецЦикла;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 3;
ТабДок.ФиксацияСлева = 5;
КонецПроцедуры
     
&НаСервере
Процедура СформироватьПоПрессформамНаСервере()
ТабДок.Очистить();
Запрос = Новый Запрос;

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблПрессформа = Макет.ПолучитьОбласть("Прессформа");
ОблТО = Макет.ПолучитьОбласть("ТО");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ВидОтчёта = ?(БезУчётаВыходныхДней,"Без учёта выходных дней: "+СписокВыходныхДней,"");
ТабДок.Вывести(ОблШапка);

ПолучитьТекстЗапроса(Запрос);
Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО
								|	ПроизводственноеЗаданиеПрессформы.Прессформа.Наименование
								|ИТОГИ ПО
								|	Прессформа"; 
Запрос.УстановитьПараметр("ДатаНач", Отчет.Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Отчет.Период.ДатаОкончания);
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаПрессформа = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
НВИтого = 0;
СтоимостьМЧИтого = 0;
Наряд = 0;
	Пока ВыборкаПрессформа.Следующий() Цикл
	НВИтого = 0;
	СтоимостьМЧИтого = 0;
	Наряд = 0;
	ОблПрессформа.Параметры.Прессформа = ВыборкаПрессформа.Прессформа;	
	ВыборкаПЗ = ВыборкаПрессформа.Выбрать();
		Пока ВыборкаПЗ.Следующий() Цикл 
		ПЗ = ВыборкаПЗ.ПЗ;
			Если ПЗ.Прессформы.Количество() > 0 Тогда
			РО = РегистрыСведений.Оборудование.ПолучитьПоследнее(ВыборкаПЗ.ДатаВыпуска,Новый Структура("Оборудование",ПЗ.Прессформы[0].Станок));			
			СтоимостьМЧ = РО.СтоимостьМЧРасчётная;		
			Иначе	
			СтоимостьМЧ = 0;
			КонецЕсли;
		ТаблицаНВ = РегистрыСведений.НормыВремени.СрезПоследних(ВыборкаПЗ.ДатаВыпуска,Новый Структура("МПЗ",ВыборкаПЗ.Изделие));
		ТаблицаНВ.Сортировать("ТехОперация");
			Для каждого ТЧ Из ТаблицаНВ Цикл
				Если ТЧ.НормаВремени > 0 Тогда
				НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(ВыборкаПЗ.ДатаВыпуска,Новый Структура("ТехОперация",ТЧ.ТехОперация));
				НВИтого = НВИтого + ТЧ.НормаВремени*ПЗ.Количество;
				СтоимостьМЧИтого = СтоимостьМЧИтого + ТЧ.НормаВремени/60*СтоимостьМЧ*ПЗ.Количество;
				Наряд = Наряд + Окр(ТЧ.НормаВремени/60*НормыТО.Стоимость,2,РежимОкругления.Окр15как20)*ПЗ.Количество;
				КонецЕсли;
			КонецЦикла;              
		КонецЦикла;    
	ОблПрессформа.Параметры.НВИтого = НВИтого;
	ОблПрессформа.Параметры.СтоимостьМЧИтого = СтоимостьМЧИтого;
	ОблПрессформа.Параметры.Наряд = Наряд;
	ТабДок.Вывести(ОблПрессформа);
	ТабДок.НачатьГруппуСтрок("ТО",Истина); 
	ВыборкаПЗ.Сбросить();
		Пока ВыборкаПЗ.Следующий() Цикл 
		ПЗ = ВыборкаПЗ.ПЗ;
			Если ПЗ.Прессформы.Количество() > 0 Тогда
			РО = РегистрыСведений.Оборудование.ПолучитьПоследнее(ВыборкаПЗ.ДатаВыпуска,Новый Структура("Оборудование",ПЗ.Прессформы[0].Станок));			
			СтоимостьМЧ = РО.СтоимостьМЧРасчётная;		
			Иначе	
			СтоимостьМЧ = 0;
			КонецЕсли;
		ТаблицаНВ = РегистрыСведений.НормыВремени.СрезПоследних(ВыборкаПЗ.ДатаВыпуска,Новый Структура("МПЗ",ВыборкаПЗ.Изделие));
		ТаблицаНВ.Сортировать("ТехОперация");
		флПЗ = Ложь;
			Для каждого ТЧ Из ТаблицаНВ Цикл 
				Если ТЧ.НормаВремени > 0 Тогда
				флПЗ = Истина;
				ОблТО.Параметры.НомерПЗ = ПЗ.Номер;
				ОблТО.Параметры.ПЗ = ПЗ;                    
				ОблТО.Параметры.ДатаОкончания = ВыборкаПЗ.ДатаВыпуска;
				ОблТО.Параметры.Наименование = СокрЛП(ВыборкаПЗ.Изделие.Наименование);
				ОблТО.Параметры.Номенклатура = ВыборкаПЗ.Изделие;
				ОблТО.Параметры.Количество = ПЗ.Количество;
				ОблТО.Параметры.Исполнитель = ВыборкаПЗ.Исполнитель;
				ОблТО.Параметры.НаименованиеТО = СокрЛП(ТЧ.ТехОперация.Наименование);
				ОблТО.Параметры.ТО = ТЧ.ТехОперация;
				ОблТО.Параметры.ВидРабот = ТЧ.ТехОперация.ВидРабот;
					Если Найти(ТЧ.ТехОперация.ВидРабот.Наименование,"Литьё") > 0 Тогда
						Если ПЗ.Прессформы.Количество() > 0 Тогда
						ОблТО.Параметры.Станок = ПЗ.Прессформы[0].Станок;
						ОблТО.Параметры.Прессформа = ПЗ.Прессформы[0].Прессформа;
						Иначе	
						ОблТО.Параметры.Станок = "";
						ОблТО.Параметры.Прессформа = "";			
						КонецЕсли;				
					Иначе
		 			ОблТО.Параметры.Станок = "";
					ОблТО.Параметры.Прессформа = "";
					КонецЕсли;
				ОблТО.Параметры.КоличествоТО = ПЗ.Количество;          
				ОблТО.Параметры.НВ = ТЧ.НормаВремени;
				НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(ВыборкаПЗ.ДатаВыпуска,Новый Структура("ТехОперация",ТЧ.ТехОперация));
				ОблТО.Параметры.ТС = НормыТО.Стоимость;
				ОблТО.Параметры.СтоимостьМЧ = СтоимостьМЧ;
				ОблТО.Параметры.СтоимостьМЧНаИзд = ОблТО.Параметры.НВ/60*СтоимостьМЧ;
				ОблТО.Параметры.Расценка = Окр(ОблТО.Параметры.НВ/60*ОблТО.Параметры.ТС,2,РежимОкругления.Окр15как20);
				ОблТО.Параметры.НВИтого = ОблТО.Параметры.НВ*ПЗ.Количество;
				ОблТО.Параметры.СтоимостьМЧИтого = ОблТО.Параметры.СтоимостьМЧНаИзд*ПЗ.Количество;
				ОблТО.Параметры.Наряд = ОблТО.Параметры.Расценка*ПЗ.Количество;
				ТабДок.Вывести(ОблТО); 
				КонецЕсли;
			КонецЦикла;
				Если Не флПЗ Тогда
				ОблТО.Параметры.НомерПЗ = ПЗ.Номер;
				ОблТО.Параметры.ПЗ = ПЗ;                    
				ОблТО.Параметры.ДатаОкончания = ВыборкаПЗ.ДатаВыпуска;
				ОблТО.Параметры.Наименование = СокрЛП(ВыборкаПЗ.Изделие.Наименование);
				ОблТО.Параметры.Номенклатура = ВыборкаПЗ.Изделие;
				ОблТО.Параметры.Количество = ПЗ.Количество;
				ОблТО.Параметры.Исполнитель = ВыборкаПЗ.Исполнитель;
				ОблТО.Параметры.НаименованиеТО = "";
				ОблТО.Параметры.ТО = "";
				ОблТО.Параметры.ВидРабот = "";
					Если ПЗ.Прессформы.Количество() > 0 Тогда
					ОблТО.Параметры.Станок = ПЗ.Прессформы[0].Станок;
					ОблТО.Параметры.Прессформа = ПЗ.Прессформы[0].Прессформа;
					Иначе	
					ОблТО.Параметры.Станок = "";
					ОблТО.Параметры.Прессформа = "";			
					КонецЕсли;				
				ОблТО.Параметры.КоличествоТО = 0;          
				ОблТО.Параметры.НВ = 0;
				ОблТО.Параметры.ТС = 0;
				ОблТО.Параметры.СтоимостьМЧ = 0;
				ОблТО.Параметры.СтоимостьМЧНаИзд = 0;
				ОблТО.Параметры.Расценка = 0;
				ОблТО.Параметры.НВИтого = 0;
				ОблТО.Параметры.СтоимостьМЧИтого = 0;
				ОблТО.Параметры.Наряд = 0;
				ТабДок.Вывести(ОблТО); 
				КонецЕсли;               
		КонецЦикла;
	ТабДок.ЗакончитьГруппуСтрок();	
	КонецЦикла;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 3;
ТабДок.ФиксацияСлева = 5;
КонецПроцедуры
 
&НаСервере
Процедура СформироватьПоНоменклатуреНаСервере()
ТабДок.Очистить();
Запрос = Новый Запрос;

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблНоменклатура = Макет.ПолучитьОбласть("Номенклатура");
ОблТО = Макет.ПолучитьОбласть("ТО");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ВидОтчёта = ?(БезУчётаВыходныхДней,"Без учёта выходных дней: "+СписокВыходныхДней,"");
ТабДок.Вывести(ОблШапка);

ПолучитьТекстЗапроса(Запрос);
Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО
								|	ВыпускПродукцииКанбан.Изделие.Наименование
								|ИТОГИ ПО
								|	Изделие"; 
Запрос.УстановитьПараметр("ДатаНач", Отчет.Период.ДатаНачала);
Запрос.УстановитьПараметр("ДатаКон", Отчет.Период.ДатаОкончания);
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
НВИтого = 0;
СтоимостьМЧИтого = 0;
Наряд = 0;
	Пока ВыборкаНоменклатура.Следующий() Цикл
	НВИтого = 0;
	СтоимостьМЧИтого = 0;
	Наряд = 0;
	ОблНоменклатура.Параметры.Номенклатура = ВыборкаНоменклатура.Изделие;	
	ВыборкаПЗ = ВыборкаНоменклатура.Выбрать();
		Пока ВыборкаПЗ.Следующий() Цикл 
		ПЗ = ВыборкаПЗ.ПЗ;
			Если ПЗ.Прессформы.Количество() > 0 Тогда
			РО = РегистрыСведений.Оборудование.ПолучитьПоследнее(ВыборкаПЗ.ДатаВыпуска,Новый Структура("Оборудование",ПЗ.Прессформы[0].Станок));			
			СтоимостьМЧ = РО.СтоимостьМЧРасчётная;		
			Иначе	
			СтоимостьМЧ = 0;
			КонецЕсли;
		ТаблицаНВ = РегистрыСведений.НормыВремени.СрезПоследних(ВыборкаПЗ.ДатаВыпуска,Новый Структура("МПЗ",ВыборкаПЗ.Изделие));
		ТаблицаНВ.Сортировать("ТехОперация");
			Для каждого ТЧ Из ТаблицаНВ Цикл
				Если ТЧ.НормаВремени > 0 Тогда
				НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(ВыборкаПЗ.ДатаВыпуска,Новый Структура("ТехОперация",ТЧ.ТехОперация));
				НВИтого = НВИтого + ТЧ.НормаВремени*ПЗ.Количество;
				СтоимостьМЧИтого = СтоимостьМЧИтого + ТЧ.НормаВремени/60*СтоимостьМЧ*ПЗ.Количество;
				Наряд = Наряд + Окр(ТЧ.НормаВремени/60*НормыТО.Стоимость,2,РежимОкругления.Окр15как20)*ПЗ.Количество;
				КонецЕсли;
			КонецЦикла;              
		КонецЦикла;    
	ОблНоменклатура.Параметры.НВИтого = НВИтого;
	ОблНоменклатура.Параметры.СтоимостьМЧИтого = СтоимостьМЧИтого;
	ОблНоменклатура.Параметры.Наряд = Наряд;
	ТабДок.Вывести(ОблНоменклатура);
	ТабДок.НачатьГруппуСтрок("ТО",Истина); 
	ВыборкаПЗ.Сбросить();
		Пока ВыборкаПЗ.Следующий() Цикл 
		ПЗ = ВыборкаПЗ.ПЗ;
			Если ПЗ.Прессформы.Количество() > 0 Тогда
			РО = РегистрыСведений.Оборудование.ПолучитьПоследнее(ВыборкаПЗ.ДатаВыпуска,Новый Структура("Оборудование",ПЗ.Прессформы[0].Станок));			
			СтоимостьМЧ = РО.СтоимостьМЧРасчётная;		
			Иначе	
			СтоимостьМЧ = 0;
			КонецЕсли;
		ТаблицаНВ = РегистрыСведений.НормыВремени.СрезПоследних(ВыборкаПЗ.ДатаВыпуска,Новый Структура("МПЗ",ВыборкаПЗ.Изделие));
		ТаблицаНВ.Сортировать("ТехОперация");
		флПЗ = Ложь;
			Для каждого ТЧ Из ТаблицаНВ Цикл
				Если ТЧ.НормаВремени > 0 Тогда
				флПЗ = Истина;
				ОблТО.Параметры.НомерПЗ = ПЗ.Номер;
				ОблТО.Параметры.ПЗ = ПЗ;                    
				ОблТО.Параметры.ДатаОкончания = ВыборкаПЗ.ДатаВыпуска;
				ОблТО.Параметры.Наименование = СокрЛП(ВыборкаПЗ.Изделие.Наименование);
				ОблТО.Параметры.Номенклатура = ВыборкаПЗ.Изделие;
				ОблТО.Параметры.Количество = ПЗ.Количество;
				ОблТО.Параметры.Исполнитель = ВыборкаПЗ.Исполнитель;
				ОблТО.Параметры.НаименованиеТО = СокрЛП(ТЧ.ТехОперация.Наименование);
				ОблТО.Параметры.ТО = ТЧ.ТехОперация;
				ОблТО.Параметры.ВидРабот = ТЧ.ТехОперация.ВидРабот;
					Если Найти(ТЧ.ТехОперация.ВидРабот.Наименование,"Литьё") > 0 Тогда
						Если ПЗ.Прессформы.Количество() > 0 Тогда
						ОблТО.Параметры.Станок = ПЗ.Прессформы[0].Станок;
						ОблТО.Параметры.Прессформа = ПЗ.Прессформы[0].Прессформа;
						Иначе	
						ОблТО.Параметры.Станок = "";
						ОблТО.Параметры.Прессформа = "";			
						КонецЕсли;				
					Иначе
		 			ОблТО.Параметры.Станок = "";
					ОблТО.Параметры.Прессформа = "";
					КонецЕсли;
				ОблТО.Параметры.КоличествоТО = ПЗ.Количество;          
				ОблТО.Параметры.НВ = ТЧ.НормаВремени;
				НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(ВыборкаПЗ.ДатаВыпуска,Новый Структура("ТехОперация",ТЧ.ТехОперация));
				ОблТО.Параметры.ТС = НормыТО.Стоимость;
				ОблТО.Параметры.СтоимостьМЧ = СтоимостьМЧ;
				ОблТО.Параметры.СтоимостьМЧНаИзд = ОблТО.Параметры.НВ/60*СтоимостьМЧ;
				ОблТО.Параметры.Расценка = Окр(ОблТО.Параметры.НВ/60*ОблТО.Параметры.ТС,2,РежимОкругления.Окр15как20);
				ОблТО.Параметры.НВИтого = ОблТО.Параметры.НВ*ПЗ.Количество;
				ОблТО.Параметры.СтоимостьМЧИтого = ОблТО.Параметры.СтоимостьМЧНаИзд*ПЗ.Количество;
				ОблТО.Параметры.Наряд = ОблТО.Параметры.Расценка*ПЗ.Количество;
				ТабДок.Вывести(ОблТО);  
				КонецЕсли;
			КонецЦикла; 
				Если Не флПЗ Тогда
				ОблТО.Параметры.НомерПЗ = ПЗ.Номер;
				ОблТО.Параметры.ПЗ = ПЗ;                    
				ОблТО.Параметры.ДатаОкончания = ВыборкаПЗ.ДатаВыпуска;
				ОблТО.Параметры.Наименование = СокрЛП(ВыборкаПЗ.Изделие.Наименование);
				ОблТО.Параметры.Номенклатура = ВыборкаПЗ.Изделие;
				ОблТО.Параметры.Количество = ПЗ.Количество;
				ОблТО.Параметры.Исполнитель = ВыборкаПЗ.Исполнитель;
				ОблТО.Параметры.НаименованиеТО = "";
				ОблТО.Параметры.ТО = "";
				ОблТО.Параметры.ВидРабот = "";
					Если ПЗ.Прессформы.Количество() > 0 Тогда
					ОблТО.Параметры.Станок = ПЗ.Прессформы[0].Станок;
					ОблТО.Параметры.Прессформа = ПЗ.Прессформы[0].Прессформа;
					Иначе	
					ОблТО.Параметры.Станок = "";
					ОблТО.Параметры.Прессформа = "";			
					КонецЕсли;				
				ОблТО.Параметры.КоличествоТО = 0;          
				ОблТО.Параметры.НВ = 0;
				ОблТО.Параметры.ТС = 0;
				ОблТО.Параметры.СтоимостьМЧ = 0;
				ОблТО.Параметры.СтоимостьМЧНаИзд = 0;
				ОблТО.Параметры.Расценка = 0;
				ОблТО.Параметры.НВИтого = 0;
				ОблТО.Параметры.СтоимостьМЧИтого = 0;
				ОблТО.Параметры.Наряд = 0;
				ТабДок.Вывести(ОблТО); 
				КонецЕсли;              
		КонецЦикла;
	ТабДок.ЗакончитьГруппуСтрок();	
	КонецЦикла;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 3;
ТабДок.ФиксацияСлева = 5;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	Состояние("Обработка...",,"Формирование таблицы отчёта...");
		//Если ОбщийМодульВызовСервера.РазрешенныйСписокЛинеек(СписокЛинеек) Тогда
			Если ГруппироватьПо = 0 Тогда
			СформироватьПоПЗНаСервере();
			ИначеЕсли ГруппироватьПо = 1 Тогда	
			СформироватьПоСтанкамНаСервере();
			ИначеЕсли ГруппироватьПо = 2 Тогда	
			СформироватьПоПрессформамНаСервере();
			Иначе
			СформироватьПоНоменклатуреНаСервере();
			КонецЕсли;		
		//КонецЕсли;
	КонецЕсли; 
КонецПроцедуры
